{
    "nombre": "Lisandro Rios",
    "age": "20 años",
    "foto": "https://lh3.googleusercontent.com/a/ACg8ocIOgZjS0G6wUwIHrTKl5ABme33DTipAl2hJvFgKgpW68g=s432-c-no",
    "position": "Programador Full Stack",
    "ubication": "Buenos Aires (Argentina)",
    "project": 
    [
        {
            "type": "Página Web",
            "name": "Porfolio Web",
            "date": "Se Actualiza Constantemente",
            "image": "https://lh3.googleusercontent.com/a/ACg8ocIOgZjS0G6wUwIHrTKl5ABme33DTipAl2hJvFgKgpW68g=s432-c-no",
            "description": "Mi portafolio web es el espacio donde exhibo mis habilidades de programación, tanto en el desarrollo backend como frontend, además de otros numerosos proyectos. A través de este sitio, doy vida a mis creaciones digitales, demostrando mi pasión por la tecnología y mi capacidad para transformar ideas en soluciones funcionales. Si deseas explorar más acerca de mi trabajo, te invito a visitar mi portafolio en este enlace. 🚀",            
            "link": "https://github.com/LisanRios/porfolio-web",
            "lenguaje": [
                {
                    "name": "fa-brands fa-angular"
                },
                {
                    "name": "fa-brands fa-bootstrap"
                },
                {
                    "name": "fa-brands fa-css3-alt"
                },
                {
                    "name": "bx bxl-typescript"
                },
                {
                    "name": "ti ti-brand-mysql"
                },
                {
                    "name": "bx bxl-spring-boot"
                },
                {
                    "name": "fa-brands fa-java"
                }
            ]
        }, 
        {
            "type": "Página Web",
            "name": "Challenge-Alura-Encriptador",
            "date": "30/04/2023",
            "image": "https://github.com/LisanRios/Challenge-Alura-Encriptador/blob/main/Captura%20de%20pantalla%202023-12-11%20110241.png?raw=true",
            "description": "El proyecto encriptador de Alura ONE es un desafío web que permite encriptar y desencriptar texto. Utiliza HTML, CSS y JavaScript, y emplea expresiones regulares para validar la entrada de texto. La aplicación resultante es totalmente responsiva.",            
            "link": "https://github.com/LisanRios/Challenge-Alura-Encriptador",
            "lenguaje": [
                {
                    "name": "fa-brands fa-html5"
                },
                {
                    "name": "fa-brands fa-css3-alt"
                },
                {
                    "name": "fa-brands fa-js"
                }
            ]
        }, 
        {
            "type": "Robótica",
            "name": "Arduino-Morse",
            "date": "05/06/2023",
            "image": "https://github.com/LisanRios/Arduino-Morse/blob/main/358172839_172667199129487_1108238551401241728_n.jpeg?raw=true",
            "description": "El proyecto se centró en la creación de un dispositivo Arduino utilizando el lenguaje C. Este dispositivo constaba de una placa Arduino Uno equipada con dos botones (representando los caracteres punto y raya en código Morse) y una pantalla que visualizaba el texto escrito en dicho código.",            
            "link": "https://github.com/LisanRios/Arduino-Morse",
            "lenguaje": [
                {
                    "name": "bx bxs-copyright"
                },
                {
                    "name": "bx bxl-c-plus-plus"
                },
                {
                    "name": "fa-solid fa-robot"
                }
            ]
        }, 
        {
            "type": "Código",
            "name": "Propiedades",
            "date": "24/11/2023",
            "image": "https://e1.pxfuel.com/desktop-wallpaper/585/789/desktop-wallpaper-c-programming-language.jpg",
            "description": "El proyecto se basó en la aplicación del lenguaje de programación C a un problema real de una empresa dedicada al sector inmobiliario. El propósito del proyecto fue crear un sistema informático que permitiera gestionar las propiedades de la empresa de forma eficiente y segura, cumpliendo con todos los requisitos funcionales y no funcionales que se habían establecido previamente. El sistema debía ofrecer funcionalidades como el registro, la búsqueda, la modificación y la eliminación de propiedades, así como la generación de informes y estadísticas.",
            "link": "https://github.com/LisanRios/Propiedades",
            "lenguaje": [
                {
                    "name": "bx bxs-copyright"
                },
                {
                    "name": "bx bxl-c-plus-plus"
                },
                {
                    "name": "bi bi-filetype-txt"
                }
            ]
        }, 
        {
            "type": "Videojuego",
            "name": "Python Invaders",
            "date": "24/11/2023",
            "image": "https://github.com/LisanRios/Python-Invaders/blob/main/TP%20PYTHON%20REEVES_RIOS_SALGUERO_NAVARRO/imagenes/inicio.png?raw=true",
            "description": "El presente proyecto fue realizado en el marco del trabajo integrador final de la asignatura Laboratorio de Informática 2 (Labo 2) de la Universidad Nacional de San Martín (UNSAM). El objetivo del trabajo consistió en desarrollar un videojuego utilizando el lenguaje de programación Python. Para ello, elegimos el desafío de diseñar y construir un juego de nuestra propia creación.",            
            "link": "https://github.com/LisanRios/Python-Invaders",
            "lenguaje": [
                {
                    "name": "fa-brands fa-python"
                }
            ]
        }, 
        {
            "type": "Videojuego",
            "name": "Buscawachas",
            "date": "24/11/2023",
            "image": "https://raw.githubusercontent.com/LisanRios/Proyecto-Final-SPD/main/test.bmp",
            "description": "El proyecto “Buscawachas” se llevó a cabo como parte un trabajo integrador final de la cátedra de Sistemas de Procesamiento de Datos (SPD) en la Universidad Nacional de San Martín (UNSAM). Nuestra tarea consistió en desarrollar un videojuego a elección. Optamos por el desafío de diseñar y construir dicho juego utilizando lenguaje ensamblador.",
            "link": "https://github.com/LisanRios/Proyecto-Final-SPD",
            "lenguaje": [
                {
                    "name": "bi bi-nut"
                }
            ]
        }, 
        {
            "type": "Trabajo De Investigación",
            "name": "Trabajo Integrador de Redes Neuronales",
            "date": "31/05/2024",
            "image": "https://ia-colombia.co/wp-content/uploads/2022/09/shutterstock_587768567.png",
            "description": "Objetivo del trabajo: Este programa realiza varias tareas relacionadas con la obtención de datos de sitios web, análisis de datos y visualización de grafos utilizando las librerías BeautifulSoup, pandas, NetworkX y Matplotlib.",
            "link": "https://github.com/LisanRios/Mate-3/tree/main/Trabajo%20Pr%C3%A1ctico%20Integrador%20de%20Matem%C3%A1tica%20III%20Lisandro%20Rios",
            "lenguaje": [
                {
                    "name": "fa-brands fa-python"
                }, 
                {
                    "name": "bx bxl-graphql"
                }
            ]
        }, 
        {
            "type": "Trabajo De Investigación",
            "name": "Prediccion de precio de criptomonedas con Redes Neuronales",
            "date": "14/06/2024",
            "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSFrNNiyIrNNjPslLaMGeyce_BOj_ccmXsy7w&s",
            "description": "Este trabajo práctico tiene como objetivo desarrollar un análisis de datos y la creación de un modelo predictivo basado en técnicas de regresión. El conjunto de datos elegido es Criptomonedas, Bolsa de Valores y Inflación que se haseleccionado por el cresiente inpacto en la vida diaria y la posibilidad de tarabajar con siencia de datos.",
            "link": "https://github.com/LisanRios/Mate-3/tree/main/Segundo%20Trabajo%20Pr%C3%A1ctico%20Integrador%20de%20Matem%C3%A1tica%20III%20Lisandro%20Rios",
            "lenguaje": [
                {
                    "name": "fa-brands fa-python"
                },
                {
                    "name": "bx bx-brain"
                }
            ]
        }, 
        {
            "type": "Videojuego",
            "name": "DOOMmies",
            "date": "08/04/2024",
            "image": "https://camo.githubusercontent.com/16718b96cadfee43257e54e50022b0f17931ae868019ca0e9b93bd57f1ab89c9/68747470733a2f2f7777772e736f6d6f7378626f782e636f6d2f77702d636f6e74656e742f75706c6f6164732f323032302f30332f64657461696c5f746162315f63617264315f31782e5f43423432303537343634395f2e6a7067",
            "description": "Este repositorio tiene como objetivo crear un juego en el lenguaje Wollok para la materia Algoritmos 1 de la carrera de Tecnicatura en Programación Informática de la Universidad Nacional de San Martín (UNSAM). El juego está inspirado en el conocido título The Binding of Isaac. Se trata de un juego de acción RPG con fuertes elementos de tipo Roguelike, en el cual los niveles se generan aleatoriamente. Pero a diferencia del mismo, ¡¡¡ÉSTE TIENE LA SKIN DEL DOOM!!!",
            "link": "https://github.com/algo1unsam/tp-game-24s1-doomies-1",
            "lenguaje": [
                {
                    "name": "fa-solid fa-w"
                }
            ]
        }, 
        {
            "type": "Sistema Operativo",
            "name": "Trabajo practico final de Sistemas Operativos",
            "date": "10/07/2024",
            "image": "https://phantom-elmundo.unidadeditorial.es/215c5d4a7810a8ae7cd275c297d0b2a6/crop/168x72/1032x648/resize/828/f/webp/assets/multimedia/imagenes/2021/08/26/16299752237253.jpg",
            "description": "Dicho trabajo consistia en crear un Sistema Operativo personalizado, cumpliendo varios requisitos especificos.",
            "link": "https://docs.google.com/document/d/1fesC_05bEUCLHQ8W-qpFERcsFwPBzlCv/edit",
            "lenguaje": [
                {
                    "name": "fa-brands fa-ubuntu"
                },
                {
                    "name": "fa-brands fa-linux"
                }
            ]
        }
    ],
    "tecnology":
    [
        {
            "icon":"fa-brands fa-angular",
            "name":"Angular",
            "nivel": "★★★★☆",
            "description":"Angular es un framework para aplicaciones web desarrollado en TypeScript, de código abierto, mantenido por Google, que se utiliza para crear y mantener aplicaciones web de una sola página."
        },
        {
            "icon":"ti ti-brand-mysql",
            "name":"MySQL",
            "nivel": "★★★★★",
            "description":"MySQL es un sistema de gestión de bases de datos relacional desarrollado bajo licencia dual: Licencia pública general/Licencia comercial por Oracle Corporation y está considerada como la base de datos"
        },
        {
            "icon":"fa-brands fa-java",
            "name":"JAVA + Spring Boot",
            "nivel": "★★★★★",
            "description":"El lenguaje de programación Java la sintaxis deriva en gran medida de C y C++, pero tiene menos utilidades de bajo nivel que cualquiera de ellos. Las aplicaciones de Java son compiladas a bytecode (clase Java), que puede ejecutarse en cualquier máquina virtual Java (JVM) sin importar la arquitectura de la computadora subyacente."
        },
        {
            "icon":"fa-brands fa-react",
            "name":"React",
            "nivel": "★★★★☆",
            "description":"React es una biblioteca Javascript de código abierto diseñada para crear interfaces de usuario con el objetivo de facilitar el desarrollo de aplicaciones en una sola página."
        },
        {
            "icon":"fa-brands fa-python",
            "name":"Python",
            "nivel": "★★★★★",
            "description":"Python es un lenguaje de programación interpretado cuya filosofía hace hincapié en la legibilidad de su código.​ Se trata de un lenguaje de programación multiparadigma, ya que soporta orientación a objetos, programación imperativa y, en menor medida, programación funcional."
        },
        {
            "icon":"bx bxs-copyright",
            "name":"C",
            "nivel": "★★★★★",
            "description":"C es un lenguaje de programación de propósito general​ originalmente desarrollado por Dennis Ritchie entre 1969 y 1972 en los Laboratorios Bell, ​ como evolución del anterior lenguaje B, a su vez basado en BCPL.​​​Al igual que B, es un lenguaje orientado a la implementación de sistemas operativos, concretamente Unix."
        },
        {
            "icon":"bi bi-nut",
            "name":"Assembly",
            "nivel": "★★★★☆",
            "description":"Assembly es un lenguaje de bajo nivel que se utiliza para programar directamente el hardware de la computadora. Es específico para cada tipo de procesador y permite un control detallado sobre el funcionamiento de la máquina."
        },
        {
            "icon":"fa-brands fa-ubuntu",
            "name":"Bash scripts on Unix/Linux",
            "nivel": "★★★★☆",
            "description":"GNU Bash o simplemente Bash es una interfaz de usuario de línea de comandos popular, específicamente un shell de Unix; así como un lenguaje de scripting."
        },
        {
            "icon":"fa-brands fa-git-alt",
            "name":"Git",
            "nivel": "★★★★★",
            "description":"Git es un software de control de versiones diseñado por Linus Torvalds, pensando en la eficiencia, la confiabilidad y compatibilidad del mantenimiento de versiones de aplicaciones cuando estas tienen un gran número de archivos de código fuente."
        },
        {
            "icon":"fa-brands fa-bootstrap",
            "name":"Boolstrap",
            "nivel": "★★★★★",
            "description":"Bootstrap es una biblioteca multiplataforma o conjunto de herramientas de código abierto para diseño de sitios y aplicaciones web."
        },
        {
            "icon":"bx bxl-typescript",
            "name":"TypeScript",
            "nivel": "★★★★☆",
            "description":"TypeScript es un lenguaje de programación libre y de código abierto desarrollado y mantenido por Microsoft. Es un superconjunto de JavaScript, que esencialmente añade tipos estáticos y objetos basados en clases."
        },
        {
            "icon":"fa-solid fa-robot",
            "name":"Arduino",
            "nivel": "★★★★☆",
            "description":"Arduino es una plataforma de hardware libre, basada en una placa con un microcontrolador y un entorno de desarrollo, diseñada para facilitar el uso de la electrónica en proyectos multidisciplinares."
        },
        {
            "icon":"fa-solid fa-code",
            "name":"Ruby on Rails",
            "nivel": "★★★☆☆",
            "description":"Arduino es una plataforma de hardware libre, basada en una placa con un microcontrolador y un entorno de desarrollo, diseñada para facilitar el uso de la electrónica en proyectos multidisciplinares."
        },
        {
            "icon":"bi bi-cpu",
            "name":"Inteligencia Artificial",
            "nivel": "★★★★★",
            "description":"La inteligencia artificial (IA) es la simulación de procesos de inteligencia humana por parte de máquinas, especialmente sistemas informáticos. Estos procesos incluyen el aprendizaje (la adquisición de información y reglas para utilizar la información), el razonamiento (usando las reglas para llegar a conclusiones aproximadas o definitivas) y la autocorrección."
        }
    ],
    "titule": 
    [
        {
            "type": "Técnico Universitario en Programación Informática",
            "name": "Universidad Nacional de San Martin (UNSAM)",
            "dateInicio": "01/02/2022",
            "dateFin": "En curso",
            "description": "Capaz de desarrollar proyectos de mediana envergadura, determinar las  necesidades  informáticas  de  empresas  de  tamaño  medio, solucionar problemas informáticos, trabajar de manera independiente en proyectos acotados a las necesidades de la pequeña y mediana industria, y colaborar en temas informáticos con profesionales cuando los  proyectos  sean  de  mayor  envergadura.  El  egresado  de  esta tecnicatura adquirirá las herramientas necesarias para comprender y utilizar eficientemente las nuevas tecnologías de programación en la resolución de problemas."
        },
        {
            "type": "Programador Web Full Stack",
            "name": "Argentina Programa 4.0",
            "dateInicio": "01/10/2022",
            "dateFin": "30/05/2023",
            "description": "Se trata de un programa nacional y federal que tiene como objetivo capacitar  a  personas  en  lenguajes  y  conocimientos  sobre programación,  testing  y  habilidades  digitales  para  potenciar  la empleabilidad  en  el  sector  del  software  y  la  tecnología."
        },
        {
            "type": "ONE",
            "name": "Oracle Next Education",
            "dateInicio": "03/04/2023",
            "dateFin": "28/9/2023",
            "description": "Oracle Next Education es un programa de educación, empleabilidad e inclusión 100% gratuito, creado para ofrecer formación de calidad a personas que no han contado con oportunidades para continuar sus estudios y desarrollar una carrera profesional."
        }
    ]
}